# 2) თქვენი სიტყვებით ახსენით თუ რატომ ვიყენებთ ფუნქციებს პითონში.

# 3) გადახედეთ რესურსს პითონის ფუნქციების შესახებ:
# https://www.w3schools.com/python/python_functions.asp

# 4) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" არის "მომხმარებლის ასაკი" წლის.

# 5) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს ერთ რიცხვს და საბოლოოდ პასუხად დააბრუნებს ამ რიცხვის კვადრატს. (რიცხვის ხარისხში აყვანის ოპერატორია **)

# 6) შექმენით ფუნქცია და გადაეცით ორი რიცხვი პარამეტრებად. ფუქნციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მეორე რიცხვის ხარისხში 

# 7) შექმენით ფუნქცია სახელწოდებით double_values რომელიც არგუმენტად მიიღებს სიას და დააბრუნებს ახალ სიას, სადაც თითოეული ელემენტი გაორმაგებული იქნება.

# 8) შექმენით ფუნქცია და გადაეცით არგუმენტად სია. ფუნქციამ უნდა დააბრუნოს ახალი სია, რომლის თითოეული ელემენტიც უნდა იყოს კვადრატში აყვანილი.

# 9) შექმენით ფუნქცია სახელწოდებით sum, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.

# 10) შექმენით ფუნქცია სახელწოდებით substract, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების სხვაობა.

# 11)  შექმენით ფუნქცია სახელწოდებით multiply, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების ნამრავლი.

# 12) შექმენით ფუნქცია სახელწოდებით divide, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების განაყოფი.

# 13) ჩანაწერს თავიდან უყურეთ აუცილებლად ‼️

# funqciebi gamoiyeneba imistvis rom tavidan avicilot kodis bevrjer gameoreba da kodis martivad gagebistvis

def user_info(name, age):
    return f"{name} არის {age} წლის."

print(user_info("გიორგი", 25))

def square(number):
    return number ** 2

print(square(5))


def power(base, exponent):
    return base ** exponent

print(power(2, 3))  

def double_values(my_list):
    return [x * 2 for x in my_list]

print(double_values([1, 2, 3]))  

def square_list(my_list):
    return [x ** 2 for x in my_list]

print(square_list([1, 2, 3])) 

def sum_numbers(a, b, c):
    return a + b + c

print(sum_numbers(2, 4, 6))  

def substract(a, b):
    return a - b

print(substract(10, 4)) 

def multiply(a, b):
    return a * b

print(multiply(3, 5))

def divide(a, b):
    if b != 0:
        return a / b
    else:
        return "ნულზე გაყოფა შეუძლებელია"

print(divide(10, 2))  
print(divide(5, 0)) 


