# 1) დაწერეთ ფუნქცია და გადაეცით მას ორი რიცხვი. პასუხად დააბრუნეთ ის რიცხვი, რომელიც ამ ორი ინტეჯერიდან ყველაზე დიდი იქნება

# 2) შექმენით ფუნქცია, რომელსაც გადასცემთ ინტეჯერების სიას. ფუნქციამ უნდა დააბრუნოს მეორე ყველაზე მცირე ელემენტი.

# 3) შექმენით ფუნქცია, რომელსაც გადასცემთ ინტეჯერების სიას. ფუნქციამ უნდა დააბრუნოს მეორე ყველაზე დიდი ელემენტი.

# 4) დაწერეთ ფუნქცია, რომელიც დააბრუნებს True-ს თუ არგუმენტად გადაცემული სტრინგის პირველი და ბოლო ასო ერთმანეთს ემთხვევა


def second_smallest(numbers):
    unique_nums = sorted(set(numbers))
    if len(unique_nums) < 2:
        return unique_nums [1]