







# 3) შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები. რაც ყველაზე მთავარია - ამ დავალების შესრულებისას, თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.

num1 = 40
num2 = 4
print (num1 + num2)
print (num1 - num2)
print (num1 * num2)
print (num1 / num2)

# 2) ახსენით თუ რისთვის არის საჭირო კარგი პრაქტიკების გამოყენება კოდის წერის დროს;

# კოდის წერისას კარგი პრაქტიკაა კომენტარის მიწერა და snake_case/camelCase და ესენი ჩვენ გვეხმარება Teamwork-ში და რამდენიმე ხნის მერე რო
# ვნახოთ ცვენი კოდი მარტივად რომ გავიგოთ ჩვენი თითოეული კოდის აზრი






# 4) აუცილებლად დაასრულეთ საკლასო ვისაც არ დაგისრულებიათ: 

# გაასწორეთ მოცემული კოდები:

# 1. first_user = "Lika"
# 2nduser = "Giorgi"
# print(first user)

first_user = "Lika"
second_user = "Giorgi"
print(first user)






# 2. first name = Data
# last % name = "random"

first_name = Data
last_name = "random"



# 3. რას გამოიტანს ეს კოდი?
# Num1 = 20
# num2 = 30
# print(num1 + num2)
# შედეგი ახსენით კომენტარებით.

# 3. რას გამოიტანს ეს კოდი?
Num1 = 20
num2 = 30
print(Num1 + num2)

#es kodi gamoitans erors radgan printshi num1 weria patara asoti xolo cvladi gviweria didi asoti

# 5) გადაიმეორეთ Python-ისა და HTML-ის განვლილი მასალა. შემდეგი Python-ს გაკვეთილზე ყველას დაგისვამთ შეკითხვებს
