# 2) თქვენი სიტყვებით ახსენით:
# • რას ეწოდება ფუნქცია?
# • რისთვის გამოიყენება ფუნქციები Python-ში.

# 3) კომენტარის სახით დაწერეთ, რას ეწოდება არგუმენტი. როგორც გაკვეთილზე ავხსენით ნახაზის საშუალებით - ასევე თქვენც გევალებათ, რომ Paint-ში ახსნათ ფუნქციის სინტაქსი და მისი არგუმენტები.

# 4) შექმენით ისეთი სია, სადაც შეინახავთ ყველა ნასწავლ მონაცემთა ტიპს ორ-ორჯერ, რომლებსაც მოათავსებთ სხვადასხვა ინდექსებზე. ბოლოს ინდექსინგის საშუალებით გამოიტანეთ მხოლოდ Boolean მნიშვნელობები.

# -- for loop --

# 5) შექმენთი სია [2, 4, 6, 8, 10].
# გადაუარეთ for ციკლით და სიის ელემენტების გაორმაგებული მნიშვნელობები ეკრანზე დაბეჭდეთ.

# 6) იპოვეთ და დაბეჭდეთ 1-დან 100-მდე რიცხვების თანმიმდებრობიდან მხოლოდ ის რიცხვები, რომლებიც იყოფა 5-ზე.

# -- while loop --

# 7) დაწერეთ პროგრამა, სადაც მომხმარებელს შემოატანინებთ რიცხვებს მანამ, სანამ ის არ შეიყვანს 0-ს. ბოლოს დაბეჭდეთ ყველა მცდელობაზე შემოტანილი რიცხვების ჯამი.

# 8) while loop-ის გამოყენებით იპოვეთ და დაბეჭდეთ 1-დან 30-მდე მხოლოდ ლუწი რიცხვები.

# -- Indexing & Slicing --

# 9) დაწერეთ პროგრამა, სადაც მომხმარებელს აარჩევინებთ ნებისმიერ სტრინგს, შემდეგ კი მოცემული სტრინგიდან მხოლოდ კენტ ინდექსზე მდგომ ელემენტებს გამოიტანს ტერმინალში.

# -- Conditional Statements --

# 10) დაწერეთ პროგრამა, რომელიც შეადარებს მომხმარებლის მიერ შემოტანილ ორ რიცხვს და დაბეჭდავს, რომელი უფრო მეტია ან ტოლია.

# 11) მომხმარებელს შემოატანინეთ ასაკი. გამოიყენეთ პირობითი განცხადებები რომ შექმნათ პროგრამა, სადაც - იმ შემთხვევაში თუ User იქნება 13 წელზე ნაკლენბი ასაკის გამოიტანთ 'You are a child'. თუ იქნება 13 წელზე მეტი, მაგრამ 18-ზე ნაკლები ასაკის დაუბეჭდეთ 'You are a teen'. თუ 18 წელზე მეტის იქნება დაუბეჭდეთ 'You are an adult.'


my_list = [10, "text", True, 5.5, False, "Python", True, 42, False]

# გამოვიტანოთ მხოლოდ Boolean ტიპის მნიშვნელობები
for item in my_list:
    if type(item) == bool:
        print(item)


numbers = [2, 4, 6, 8, 10]
for num in numbers:
    print(num * 2)


for num in range(1, 101):
    if num % 5 == 0:
        print(num)

total = 0
while True:
    num = int(input("შეიყვანეთ რიცხვი (0-ს დააწექით გასათავებლად): "))
    if num == 0:
        break
    total += num
print("შეყვანილი რიცხვების ჯამი არის:", total)


num = 2
while num <= 30:
    print(num)
    num += 2

string = input("შეიყვანეთ ნებისმიერი სტრინგი: ")
result = ""
for i in range(len(string)):
    if i % 2 != 0:
        result += string[i]
print("კენტ ინდექსებზე მყოფი სიმბოლოები:", result)


num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))

if num1 > num2:
    print(f"{num1} უფრო მეტია.")
elif num1 < num2:
    print(f"{num2} უფრო მეტია.")
else:
    print("ორივე რიცხვი ტოლია.")


age = int(input("შეიყვანეთ თქვენი ასაკი: "))

if age < 13:
    print("You are a child")
elif 13 <= age < 18:
    print("You are a teen")
else:
    print("You are an adult.")
