# 2) აუცილებლად უყურეთ ჩანაწერს თავიდან

# 3) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 50-დან 200-მდე for loop-ის გამოყენებით.

# 4) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა ლუწ რიცხვს 1-დან 100-ის ჩათვლით for loop-ის გამოყენებით.

# 5) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა კენტ რიცხვს 100-დან 150-მდე for loop-ის გამოყენებით.

# 6) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 1-დან 50-ის ჩათვლით while loop-ის გამოყენებით.

# 7) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 20-დან 60-ის ჩათვლით, 5-ის გამოტოვებით while loop-ის გამოყენებით.


for i in range (50, 201): 
print(i)

for i in range(2, 101, 2):
print(i)

for i in range (1, 101):
if i % 2 == 0:
print(i)

for i in range(100, 151):
    if i % 2 != 0:
        print(i)

        i = 1
while i <= 50:
    print(i)
    i += 1

    i = 20
while i <= 60:
    if i != 5:
        print(i)
    i += 1

    
