# 2) დაწერეთ პროგრამა, სადაც თავდაპირველად მომხმარებელს შემოატანინებთ ანგარიშის პაროლს, შემდეგ შეეკითხეთ რომ გაიმეოროს იქამდე, სანამ არ დაემთხვევა შეყვანილი პაროლი.

# 3) შექმენით Number guess game:

# ცვლადში შეინახეთ სასურველი რიცხვი. მომხმარებელს Input-ის მეშვეობით შეეკითხეთ ეცადოს რიცხვის გამოცნობა, ვერ გამოცნობის შემთხვევა გამოუტანეთ "Try again" და იქამდე გამოუტანეთ Input ველი სანამ არ გამოიცნობს რიცხვს. წარმატებით გამოცნობის შემთხვევაში გამოუტანეთ "You guessed the number sucessfully!".

# 4) შექმენით სია, სადაც შეინახავთ თქვენს საყვარელ ცხოველებს. გამოიტანეთ სიიდან პირველი და ბოლო ელემენტი და ერთ ხაზზე დაბეჭდეთ.

# 5) შექმენით სია და მასში შეინახეთ თქვენი საყვარელი ფერები (მინიმუმ 5). გამოიყენეთ უარყოფითი ინდექსინგი (Negative Indexing) იმისთვის, რომ გამოიტანოთ სიის მესამე ელემენტი.

# ----------
# HARD LEVEL:

# შექმენით სახელების სია და მასში დაამატეთ 3 სახელი, თუმცა სამივე სახელი უნდა იყოს მომხმარებლის მიერ შემოტანილი. დაბეჭდეთ სიის მნიშვნელობა.


password = input("შეიყვანეთ პაროლი: ")


repeat = input("გაიმეორეთ პაროლი: ")

while repeat != password:
    print("პაროლები არ ემთხვევა. სცადეთ კიდევ ერთხელ.")
    repeat = input("გაიმეორეთ პაროლი: ")

print("პაროლი წარმატებით დადასტურდა!")



secret = 7  
guess = int(input("ცადე გამოიცნო რიცხვი: "))

while guess != secret:
    print("Try again")
    guess = int(input("ცადე თავიდან: "))

print("You guessed the number successfully!")


animals = ["კატა", "ძაღლი", "ვეფხვი", "პინგვინი", "ზვიგენი"]

print(animals[0], animals[-1])


colors = ["წითელი", "ლურჯი", "მწვანე", "იისფერი", "ნარინჯისფერი"]


print(colors[-3])  


names = []


for i in range(3):
    name = input(f"შეიყვანე {i+1}-ე სახელი: ")
    names.append(name)

print("სახელების სია:", names)
